---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarShapeConstraintRadius
source: html/17bf5b30-c8c7-f442-4eb8-f6f2401ab374.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeConstraintRadius

A radius constraint associated with an arc in a RebarShapeDefinition.

## Syntax (C#)
```csharp
public class RebarShapeConstraintRadius : RebarShapeConstraint
```